Examples/other/OSCFD_cleaningTank3D/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    wall
    {
        type            wall;
        nFaces          27916;
        startFace       1099620;
    }
    atmosphere
    {
        type            patch;
        nFaces          7000;
        startFace       1127536;
    }
    inlet
    {
        type            patch;
        nFaces          400;
        startFace       1134536;
    }
    outlet
    {
        type            patch;
        nFaces          324;
        startFace       1134936;
    }
)

// ************************************************************************* //
